---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinitionId.op_Equality(Autodesk.Revit.DB.FailureDefinitionId,Autodesk.Revit.DB.FailureDefinitionId)
source: html/a1872570-45a1-b596-b9b0-3a649efd8eaa.htm
---
# Autodesk.Revit.DB.FailureDefinitionId.op_Equality Method

Compares two FailureDefinitionId instances.

## Syntax (C#)
```csharp
public static bool operator ==(
	FailureDefinitionId first,
	FailureDefinitionId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.FailureDefinitionId`) - The first FailureDefinitionId.
- **second** (`Autodesk.Revit.DB.FailureDefinitionId`) - The second FailureDefinitionId.

## Returns
True if the inputs are identical, false if they are different.